package petrovskoe

/*
* Что надо знать про окончания?
*
* Прилагательные в мужском и среднем роде, имеющие в форме именительного падежа единственного числа
* окончания -ый, -ій, в родительном падеже окан­чиваются на -аго, -яго.
*
*     «А бобренокъ сидитъ, глаза на всѣхъ таращитъ. Не понимаетъ ничего. Дядя Ѳедоръ ему молока далъ кипяченаго» («Дядя Ѳедоръ, песъ и котъ»).
*
*     «Вотъ онъ [шарикъ] пролетѣлъ послѣдній этажъ большущаго дома, и кто-то высунулся изъ окна и махалъ ему вслѣдъ,
*     а онъ еще выше и немножко вбокъ, выше антеннъ и голубей, и сталъ совсѣмъ ма­ленькій…» («Денискины разсказы»).
*
* Прилагательные в женском и среднем роде во множественном числе оканчива­ются на ‑ыя, -ія (а не -ые, -ие, как сейчас).
* Местоимение третьего лица женского рода она в родительном падеже имеет форму ея, в отличие от винительного её (сей­час везде её).
*
*     «Ну и что? — говоритъ Шарикъ. — Необязательно большую корову покупать. Ты купи маленькую.
*     Есть такія спеціальныя коровы для ко­товъ. Козы называются» («Дядя Ѳедоръ, песъ и котъ»).
*
*     «А деньги я вамъ высылаю — сто рублей. Если у васъ останутся лишнія, пришлите обратно» («Дядя Ѳедоръ, песъ и котъ»).
*
*     «Въ то время у мамы былъ отпускъ, и мы гостили у ея родныхъ, въ од­номъ большомъ колхозѣ» («Денискины разсказы»).
 */
